app/views/users/show.html.erb


<h3>Games Played: <%=@user.games.length%></h3>
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = $1 ORDER BY "games"."id" DESC  [["user_id", 2]]