app/controllers/games_controller.rb

  def show
    @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @game = Game.new
    @game.difficulty = params[:difficulty]
    if current_user
      @game.user = current_user
    else
      temp_user = User.find_by(id:1)
      @game.user = temp_user
    end
    @game.save
    @game.user.total_games += 1
    @game.user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "games" ("user_id", "difficulty", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["difficulty", "impossible"], ["created_at", 2017-01-16 19:32:46 UTC], ["updated_at", 2017-01-16 19:32:46 UTC]]
UPDATE "users" SET "total_games" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["total_games", 1], ["updated_at", "2019-01-06 03:10:02.457202"], ["id", 2]]

  def edit
    @game = Game.find(params[:id])
    p @game
    if request.xhr?
        @game.game_board = GamesHelper.plot(params[:player_move], @game.game_board)
        if check_board('x', @game.game_board)
          @game.game_status = "Player Won!"
        end

        dice = generate_rand(@game.difficulty)
        unless empty_tiles(@game.game_board).empty?
          if dice > 5
            @game.game_board = num_away(1, @game.game_board)
          else
            @game.game_board = random_move(@game.game_board)
          end
        end

        if check_board('o', @game.game_board)
          @game.game_status = "Computer Won!"
        end
        if empty_tiles(@game.game_board).empty? && @game.game_status == "ongoing"
          @game.game_status = "Draw!"
        end
        @game.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "games" SET "game_status" = $1, "game_board" = $2, "updated_at" = $3 WHERE "games"."id" = $4  [["game_status", "Computer Won!"], ["game_board", "{{x,o,\" \",\" \",o},{o,x,x,o,o},{x,x,o,x,o},{x,x,x,o,o},{x,o,x,\" \",o}}"], ["updated_at", 2017-01-16 19:33:03 UTC], ["id", 1]]