app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "abc"], ["password_digest", "$2a$10$AFDxsMxkGgGGesgCLUl/Zuzow0J30jDgsK9EU.oo8nG7PhXpf04V6"], ["created_at", 2017-01-16 19:32:16 UTC], ["updated_at", 2017-01-16 19:32:16 UTC]]

  def show
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]